// main content in web site
let center = document.querySelector('.center')

// arry for push object
let addbook = []

// your personal library
let libery = document.getElementById('libery')

// main information

let mybook = [{
        id: 1,
        title: "کمدی الهی",
        author: "دانته",
        published_date: 1472,
        language: "ایتالیایی",
        genre: "شعر",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    },
    {
        id: 2,
        title: "ضیافت",
        author: "افلاطون",
        published_date: 385,
        language: "یونانی",
        genre: "فلسفه",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    },
    {
        id: 3,
        title: "منطق الطیر",
        author: "عطار",
        published_date: 1177,
        language: "فارسی",
        genre: "شعر",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    },
    {
        id: 4,
        title: "مثنوی معنوی",
        author: "مولوی",
        published_date: 1258,
        language: "فارسی",
        genre: "شعر",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    },
    {
        id: 5,
        title: "دیوان حافظ",
        author: "حافظ",
        published_date: 1200,
        language: "فارسی",
        genre: "شعر",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"

    },
    {
        id: 6,
        title: "رومیو و جولیت",
        author: "ویلیام شکسپیر",
        published_date: 1595,
        language: "انگلیسی",
        genre: "عاشقانه",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    },
    {
        id: 7,
        title: "دیوان اشعار شهریار",
        author: "شهریار",
        published_date: 1955,
        language: "فارسی",
        genre: "عاشقانه",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"


    },
    {
        id: 8,
        title: "ویس و رامین",
        author: "فخرالدین اسعد گرگانی",
        published_date: 1054,
        language: "فارسی",
        genre: "عاشقانه",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    },
    {
        id: 9,
        title: "گلستان سعدی",
        author: "سعدی",
        published_date: 1258,
        language: "فارسی",
        genre: "شعر"
    },

    {
        id: 10,
        title: "گلشن راز",
        author: "شیخ محمود شبستری",
        published_date: 1311,
        language: "فارسی",
        genre: "شعر",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    },
    {
        id: 11,
        title: "لیلی و مجنون",
        author: "نظامی",
        published_date: 1188,
        language: "فارسی",
        genre: "عاشقانه",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    },
    {
        id: 12,
        title: "شاهنامه",
        author: "فردوسی",
        published_date: 1010,
        language: "فارسی",
        genre: "شعر",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    },
    {
        id: 13,
        title: "ایلیاد",
        author: "هومر",
        published_date: 762,
        language: "یونانی",
        genre: "شعر",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    },
    {
        id: 14,
        title: "ادیسه",
        author: "هومر",
        published_date: 725,
        language: "یونانی",
        genre: "شعر",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    },

    {
        id: 15,
        title: "هملت",
        author: "ویلیام شکسپیر",
        published_date: 1609,
        language: "یونانی",
        genre: "درام",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    },
    {
        id: 16,
        title: "دون کیشوت",
        author: "میگل دسروانتس",
        published_date: 1605,
        language: "اسپانیایی",
        genre: "درام",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    }, {
        id: 18,
        title: " بوستان سعدی",
        author: " سعدی",
        published_date: 1605,
        language: " سعدی",
        genre: "حماسی",
        about: "مهم‌ترین اثر شهریار منظومه حیدربابایه سلام (سلام به حیدربابا) است که از شاهکارهای ادبیات ترکی آذربایجانی به‌شمار می‌رود و شاعر در آن از اصالت و زیبایی‌های روستا یاد کرده‌است. این مجموعه در میان اشعار مدرن قرار گرفته و به بیش از ۸۰ زبان زندهٔ دنیا ترجمه شده است. شهریار در سرودن انواع گونه‌های شعر فارسی -مانند قصیده، مثنوی، غزل، قطعه، رباعی و شعر نیمایی- نیز تبحر داشته‌است"
    }

]
let favrite = []
    // form foe event preventDefault
let formsearch = document.querySelector('#form')




// input search for find book
let boxs = document.getElementById('boxsaerch')
    // btn search for submit find book
let btnSubmit = document.getElementById("btnserach")
    // checkbox for find kind book
let boxkindBook = document.getElementById('boxkindBook')
    // checkbox for find language book
let boxlan = document.getElementById('boxlan')
    // checkbox for find name person
let namePerson = document.getElementById('namePerson')
    // checkbox for find genre
let boxgenre = document.getElementById('boxgenre')

// function filter find book

let menu = document.querySelector("#select")
let btnback = document.querySelector('.btnBack')
let plibrary = document.querySelector("#libery")
let text = document.querySelector('.text')
let additem = ""
let show = document.querySelector("#show")

let pageMain = document.querySelector("#mainPage")


var x = document.getElementById("snackbar");


let listbookMaster=Object.keys(mybook).map((key)=>[(key),mybook[key]]).flat()


let ha=""
function filterbookLIst(){

ha=mybook.filter(function(el){
    return  el.title.match(boxs.value)
  
})
render(ha)

}

boxs.addEventListener("keyup",filterbookLIst)